КанцОптТорг/src/Documents/НачислениеПремии/НачислениеПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеПремии</name>
  <registerRecords>CalculationRegister.НачисленияЗП</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолжностьПередСотрудниками</registerRecords>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КанцОптТорг/src/CalculationRegisters/НачисленияЗП/НачисленияЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>НачисленияЗП</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <schedule>InformationRegister.График</schedule>
  <scheduleValue>InformationRegister.График.Resource.РабочийДень</scheduleValue>
  <scheduleDate>InformationRegister.График.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.Начисления</chartOfCalculationTypes>
  <resources>
    <name>Резульат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РасчетныеДанные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

КанцОптТорг/src/AccumulationRegisters/ЗадолжностьПередСотрудниками/ЗадолжностьПередСотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗадолжностьПередСотрудниками</name>
  <resources>
    <name>Долг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

КанцОптТорг/src/Documents/НачислениеПремии/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр НачисленияЗП
	Движения.НачисленияЗП.Записывать = Истина; 
	Движения.ЗадолжностьПередСотрудниками.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.НачисленияЗП.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.Начисления.ПремияСуммой;
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.Резульат = ТекСтрокаСотрудники.СуммаПремии;
		
		Движение = Движения.ЗадолжностьПередСотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.Долг = ТекСтрокаСотрудники.СуммаПремии;
	КонецЦикла;
	
КонецПроцедуры
